Revit 2024 API
ContourSetting.GetContourSettingItems Method
 Get all contour setting items.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public IList<ContourSettingItem> GetContourSettingItems()
Visual Basic
Public Function GetContourSettingItems As IList(Of ContourSettingItem)
Visual C++
public:
IList<ContourSettingItem^>^ GetContourSettingItems()
Return Value
 An array of contour setting items.
See Also
ContourSetting Class
Autodesk.Revit.DB Namespace